<template>
  <div id="Instruction">
    <div class="instruct_text">
      <h2 align="center">使用说明</h2>
      <p>
        &nbsp;&nbsp;&nbsp;&nbsp;本系统采用Vue前端框架和Python后端语言进行开发，前端内容已打包为文件夹形式、后端内容已打包成exe的可执行文件形式。
        用户若要在本地电脑使用该系统，只需要首先将exe文件双击运行，
        然后双击文件夹中的index.html文件，即可进入该系统的首页进行操作使用。下面详细介绍各模块的使用方法：
      </p>
      <p>
        &nbsp;&nbsp;&nbsp;&nbsp;<b>1.“系统介绍”模块：</b>
        用户点击左边的侧边栏中的第一项——“系统介绍”，即可进入该系统的介绍页面，浏览关于本系统的相关研究背景和研究方法。
      </p>
      <p>
        &nbsp;&nbsp;&nbsp;&nbsp;<b>2.“使用说明”模块：</b>
        用户点击左边侧边栏中的第二项——“使用说明”，即可进入该系统的使用说明页面，浏览关于本系统各模块的使用方法。
      </p>
      <p>
        &nbsp;&nbsp;&nbsp;&nbsp;<b>3.“故障预测”模块：</b>
        用户点击左边侧边栏中的第三项——“故障预测”，即可进入故障预测模块，
        该模块主要包括“参数选择”和“故障预测”两部分。用户首先点击“选取文件”按钮，选取需要进行故障预测的测试文件(仅限csv格式)，
        文件上传成功之后，会出现该文件中的所有参数列表，可以选取相应的参数，点击“查看数据”，查看所选取参数的运行曲线；
        点击“故障预测”按钮，会出现所选取参数的故障预测结果，结果以图的形式可视化展示。
      </p>
      <p>
        &nbsp;&nbsp;&nbsp;&nbsp;<b>4.“关联关系挖掘”模块：</b>
        用户点击左边侧边栏中的第四项——“关联关系挖掘”，即可进入关联关系挖掘模块，
        该模块主要包括“参数选择”和“故障关联分析与挖掘”两部分。其中“参数选择”部分与上一模块相同；
        在“故障关联分析与挖掘”部分，用户点击“关联分析”按钮，下方便会出现关联分析的文字输出结果，
        点击“可视化”按钮，下方便会出现关联分析的可视化关系图。
      </p>
<!--      <p align="center" class="para">-->
<!--        <img src="../assets/logo.png" />-->
<!--      </p>-->
<!--      <h2 class="mt50">木业网的优势</h2>-->
<!--      <p>木业网拥有近20万的注册会员，日均访问量达35万人次，合作企业超过12万家，每日更新木业供求商机约6000多条，拥有220万条有效商业机会的数据(截止2016年11月)；公司于2005年起连续多年获得电子商务世界颁发的中国行业电子商务TOP100强和最具投资价值奖，在未来的发展进程中，木业网将秉持"稳固与发展，求实与创新”的发展理念，凭借自身的行业背景、高效的工作团队和优质的软硬件设施，坚持"垂直化，深入化，细分化"的发展思路，继续保持并扩大平台在行业的优势，成为中国木业行业内网络服务、书刊杂志传播、信息化建设、贸易促进的知名网络媒体。为整个木业行业内企业提供更全面的服务，同时为推动中国信息化产业的发展、促进实体经济与互联网深度融合作出自己的贡献。</p>-->
    </div>

  </div>

</template>

<script>
export default {
  name: "Instruction"
}
</script>

<style scoped>
  .instruct_text{
    font-size: 25px;
  }
  #Instruction{
    padding-right: 30px;
    padding-left: 30px;
  }
</style>
