<template>
  <div id="Introduction">
    <div class="intro_text">
      <h2 align="center">系统介绍</h2>
      <p>
        &nbsp;&nbsp;&nbsp;&nbsp;当前的故障诊断和故障预测技术研究大多依赖在轨遥测数据，而且是单参数或简单的关联参数，
        没有考虑多参数之间的复杂关联性，也未将地面数据、在轨数据、故障信息等进行融合分析、找出规律、预测故障。无法全面满足星上产品故障诊断快速、准确的高要求，
        因此迫切需要综合利用星上产品的在轨遥测数据、在轨故障信息、在轨单机性能指标数据、在轨可靠性数据、轨道信息、地面测试数据、地面可靠性数据、产品筛选数据等，
        从数据全面性、诊断智能化、预测准确性、应用有效性等方面提高对任务需求的支援和保障能力。
      </p>
      <p>
        &nbsp;&nbsp;&nbsp;&nbsp;卫星的知识分为星上产品结构知识、功能知识、机理知识、故障处理知识等等。
        这些知识的获取方式可以是人工获取，也可以是通过机器学习和机器感知获取。
        通过故障关联分析与知识挖掘将获取的知识用规则集合等表示出来，从而为智能诊断和智能预测打下知识基础。
      </p>
      <p>
        &nbsp;&nbsp;&nbsp;&nbsp;本系统将选取电源、控制等系统级在轨关联耦合故障开展关联分析与知识挖掘研究，并利用在轨数据进行应用验证。
        航天器多维度数据融合与知识深度挖掘系统主要由四个模块构成：<b>系统介绍、使用说明、故障预测、关联关系挖掘</b>。
        其中<b>“系统介绍”</b>模块主要介绍本系统的功能以及实现方法，<b>“使用说明”</b>模块主要介绍本系统运行方法以及操作方式。
        下面详细介绍“故障预测”模块和“关联关系挖掘”模块。
      </p>
      <p>
        &nbsp;&nbsp;&nbsp;&nbsp;<b>故障预测：</b>本模块主要是实现“故障预测模型知识挖掘”。
        卫星长期处于恶劣的外层空间环境中，其在轨运行期间可能会出现不可预见的异常或故障，
        因此及时有效的故障预测模型可以确保卫星的长期稳定运行。本模块使用Transformer捕获序列之间的潜在相关性，
        使用位置编码为数据附加时序信息，使用多尺度特征融合算法获得更加强大的特征表达。
        最后，通过具有特殊残差结构的变分自编码器综合考虑提取到的特征信息，对数据进行预测，利用预测误差进行有效的故障预测。
      </p>
      <p>
        &nbsp;&nbsp;&nbsp;&nbsp;<b>关联关系挖掘：</b>本模块主要是实现“多参数关联关系挖掘”。
        卫星内部结构复杂，某一部件发生故障可能会传播至其他部件引发一系列衍生故障，
        及时挖掘卫星系统耦合故障的多参数关联关系可以为地面管理人员提供决策支持。
        本模块首先引入传递熵方法生成所有遥测变量之间的因果关系网络，并优化估值算法Copula-TE提高其计算效率和剔除间接因果边；
        然后提出一种有效的闭合模式挖掘算法CloPMVP，在得到的因果关联参数规则基础上，对结果集进行压缩。
      </p>
<!--      <p align="center" class="para">-->
<!--        <img src="../assets/logo.png" />-->
<!--      </p>-->
<!--      <h2 class="mt50">木业网的优势</h2>-->
<!--      <p>木业网拥有近20万的注册会员，日均访问量达35万人次，合作企业超过12万家，每日更新木业供求商机约6000多条，拥有220万条有效商业机会的数据(截止2016年11月)；公司于2005年起连续多年获得电子商务世界颁发的中国行业电子商务TOP100强和最具投资价值奖，在未来的发展进程中，木业网将秉持"稳固与发展，求实与创新”的发展理念，凭借自身的行业背景、高效的工作团队和优质的软硬件设施，坚持"垂直化，深入化，细分化"的发展思路，继续保持并扩大平台在行业的优势，成为中国木业行业内网络服务、书刊杂志传播、信息化建设、贸易促进的知名网络媒体。为整个木业行业内企业提供更全面的服务，同时为推动中国信息化产业的发展、促进实体经济与互联网深度融合作出自己的贡献。</p>-->
    </div>

  </div>

</template>

<script>
  export default {
    name: "Introduction"
  }
</script>

<style scoped>
  .intro_text{
    font-size: 25px;
  }
  #Introduction{
    padding-right: 30px;
    padding-left: 30px;
  }

</style>
